# -*- encoding:utf-8 -*-
import pandas as pd
import numpy as np

#############################################################################
'''
省份筛选
'''
def Province_select():
    # 经纬度信息
    lati_longti= {'吉林': [125.326800, 43.896160], '黑龙江': [126.662850, 45.742080],
                  '辽宁': [123.429250, 41.835710], '内蒙古': [111.765220, 40.817330],
                  '新疆': [87.627100, 43.793430], '青海': [101.780110, 36.620870],
                  '北京': [116.407170, 39.904690], '天津': [117.199370, 39.085100],
                  '上海': [121.473700, 31.230370], '重庆': [106.550730, 29.564710],
                  '河北': [114.469790, 38.035990], '河南': [113.753220, 34.765710],
                  '陕西': [108.954240, 34.264860], '江苏': [118.762950, 32.060710],
                  '山东': [117.020760, 36.668260], '山西': [112.562720, 37.873430],
                  '甘肃': [103.826340, 36.059420], '宁夏': [106.258670, 38.471170],
                  '四川': [104.075720, 30.650890], '西藏': [91.117480, 29.647250],
                  '安徽': [117.285650, 31.861570], '浙江': [120.153600, 30.265550],
                  '湖北': [114.342340, 30.545390], '湖南': [112.983400, 28.112660],
                  '福建': [119.296590, 26.099820], '江西': [115.910040, 28.674170],
                  '贵州': [106.707220, 26.598200], '云南': [102.709730, 25.045300],
                  '广东': [113.266270, 23.131710], '广西': [108.327540, 22.815210],
                  '香港': [114.165460, 22.275340], '澳门': [113.549130, 22.198750],
                  '海南': [110.348630, 20.019970], '台湾': [121.520076, 25.030724]}

    real_prov={}
    # print(lati_longti['江苏'])
    iwanna_location=input("请输入想要考取的大学的所在省份：（用空格隔开）").split(" ")
    for i in iwanna_location:
        if i in list(lati_longti.keys()):
            real_prov.update({i:lati_longti[i]})

    return real_prov

Province_select()

#############################################################################
'''
选择是否为双一流大学
'''
def Double_first_class_select():
    iwanna_class=input("请输入是否需要是双一流大学：(y/n)")
    df=pd.read_csv('./colle_shrink.csv')
    class_name=df.loc[:,['大学','是否为双一流']]
    # 判断输入合法性
    while True:
        try:
            if iwanna_class=='y':
                new_class=class_name[class_name['是否为双一流']=='是']
            elif iwanna_class=='n':
                new_class=class_name
            break
        except:
            print('您输入的内容不规范，请重新输入')

        return new_class
    return new_class


#############################################################################
'''
选择是否只想去一本
'''
def first_class_tier():
    iwanna_tier=input("请输入是否只想去一本：(y/n)")
    df = pd.read_csv('./colle_shrink.csv')
    tier_name = df.loc[:, ['大学', '本数']]
    # 判断输入合法性
    while True:
        try:
            if iwanna_tier == 'y':
                new_tier = tier_name[tier_name['本数'] == '一本']

            elif iwanna_tier=='n':
                new_tier = tier_name
            break
        except:
            print('您输入的内容不规范，请重新输入')
    return new_tier
